In [1]:
import numpy as np
import pandas as pd

In [6]:
L = [1,2,3,4,5]
P = pd.Series(L, index = ['a', 'b', 'c', 'd', 'e'])
P

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [7]:
P['e']

5

In [8]:
P[['a', 'c']]

a    1
c    3
dtype: int64

In [9]:
P.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [10]:
P.values

array([1, 2, 3, 4, 5], dtype=int64)

In [11]:
charcter = {'name':['나루토', '가아라', '킬러비', '하쿠', '데이다라'],
            'town':['나뭇잎', '모래', '구름', '안개', '바위'],
            'age':[15,15,38,13,19],
            'skill':['나선환','사박궤','미수옥','빙결','폭탄']
}

In [13]:
ninja = pd.DataFrame(charcter)
ninja

   name town  age skill
0   나루토  나뭇잎   15   나선환
1   가아라   모래   15   사박궤
2   킬러비   구름   38   미수옥
3    하쿠   안개   13    빙결
4  데이다라   바위   19    폭탄

In [29]:
ninja.index = ['A', 'B', 'C', 'D', 'E']
ninja

   name town  age skill
A   나루토  나뭇잎   15   나선환
B   가아라   모래   15   사박궤
C   킬러비   구름   38   미수옥
D    하쿠   안개   13    빙결
E  데이다라   바위   19    폭탄

In [30]:
ninja.loc['C']

name     킬러비
town      구름
age       38
skill    미수옥
Name: C, dtype: object

In [31]:
ninja.iloc[4]

name     데이다라
town       바위
age        19
skill      폭탄
Name: E, dtype: object

In [33]:
ninja.loc[['B', 'D', 'E']]

   name town  age skill
B   가아라   모래   15   사박궤
D    하쿠   안개   13    빙결
E  데이다라   바위   19    폭탄

In [34]:
ninja.iloc[2:4]

  name town  age skill
C  킬러비   구름   38   미수옥
D   하쿠   안개   13    빙결

In [42]:
ninja.loc[['A', 'D'], 'name':'age']

  name town  age
A  나루토  나뭇잎   15
D   하쿠   안개   13

In [47]:
ninja.iloc[[2,4], 1:3]

  town  age
C   구름   38
E   바위   19

In [48]:
ninja

   name town  age skill
A   나루토  나뭇잎   15   나선환
B   가아라   모래   15   사박궤
C   킬러비   구름   38   미수옥
D    하쿠   안개   13    빙결
E  데이다라   바위   19    폭탄

In [53]:
ninja.loc['D', 'skill'] = '빙둔'
ninja

   name town  age skill
A   나루토  나뭇잎   15   나선환
B   가아라   모래   15   사박궤
C   킬러비   구름   38   미수옥
D    하쿠   안개   13    빙둔
E  데이다라   바위   19    폭탄

In [60]:
ninja.loc[ninja['age'] >16]

   name town  age skill
C   킬러비   구름   38   미수옥
E  데이다라   바위   19    폭탄

In [67]:
ninja['age'].mean()

20.0